[
  {
      "title": " Tips for Growing Beautiful Roses in Your Garden",
      "image": "https://s42814.pcdn.co/wp-content/uploads/2019/12/15_cottage_roses.jpg.webp",
      "content": "Roses can add beauty and fragrance to any garden. Here are some tips for successful rose cultivation: - Choose a sunny spot with well-draining soil. - Prune your roses in late winter or early spring to encourage new growth. - Water deeply and regularly, especially during dry spells. - Mulch around the base of your roses to retain moisture and prevent weeds. - Use a balanced fertilizer to promote healthy blooms. - Keep an eye out for common pests and diseases and take appropriate measures.",
      
      "dateCreated": "45175.38542"
    
  },
  {
      "title": "Identifying Common Garden Pests and How to Deal with Them",
      "image": "https://thumbor.forbes.com/thumbor/fit-in/900x510/https://www.forbes.com/home-improvement/wp-content/uploads/2022/04/featured-image-pest.jpeg.jpg",
      "content": "Garden pests can wreak havoc on your plants. Learn to identify and combat them: - Aphids: Spray them off with a strong stream of water or use insecticidal soap. - Slugs and Snails: Set up beer traps or use diatomaceous earth as a barrier. - Caterpillars: Handpick them or use BT (Bacillus thuringiensis) insecticide. - Deer: Install fencing or use deer repellent sprays. - Rabbits: Protect plants with fencing or wire mesh. - Squirrels: Use squirrel-proof bird feeders to keep them away from your garden.",
      
      "dateCreated": "45175.47917"
  },
  {
      "title": "Indoor Plant Care Tips for a Green Home Oasis",
      "image": "https://hips.hearstapps.com/hmg-prod/images/woman-with-curly-hair-planting-in-living-room-royalty-free-image-1659098260.jpg",
      "content": "Indoor plants can liven up your living space. Here are some care tips: - Choose the right plants for your light conditions (low, medium, or bright). - Water thoroughly but allow the soil to dry slightly between waterings. - Use a well-draining potting mix and pots with drainage holes. - Dust the leaves regularly to help with photosynthesis. - Fertilize during the growing season, usually spring and summer. - Repot when the plant becomes root-bound or outgrows its container.",
      
      "dateCreated": "45175.61458"
  }
]